const db = require("./db");
const { collection, setDoc, doc } = require('firebase/firestore');

const menus = {
  // "2025-11-01": {
  //   bf: {
  //     mains: ["백미밥", "미역국"],
  //     sides: ["불고기", "김치", "콩나물무침"]
  //   },
  //   lc: {
  //     mains: ["흑미밥", "된장국"],
  //     sides: ["오징어볶음", "김치", "오뎅볶음"]
  //   },
  //   dn: {
  //     mains: ["보리밥", "시금치국"],
  //     sides: ["닭볶음탕", "김치", "잡채"]
  //   }
  // },
  "2025-11-02": {
    bf: {
      mains: ["백미밥", "미역국"],
      sides: ["찜닭", "어묵볶음", "마늘무침", "콩나물무침", "배추겉절이"]
    },
    lc: {
      mains: ["참치김치볶음밥", "미역국"],
      sides: ["탕수육","계란후라이", "마늘무침", "콩나물무침", "배추김치"]
    },
    dn: {
      mains: ["흑미밥", "청국장"],
      sides: ["갈치조림", "김치", "두부조림", "시금치무침", "오이무침"]
    }
  },
  "2025-11-03": {
    bf: {
      mains: ["백미밥", "크림스프"],
      sides: ["치킨까스", "후르츠샐러드", "그린빈스볶음", "오이피클", "스위트콘", "배추김치"]
    },
    lc: {
      mains: ["백미밥", "뼈해장국"],
      sides: ["만두찜", "오징어젓무침", "취나물무침", "콩조림", "쥐어채볶음", "배추김치"]
    },
    dn: {
      mains: ["흑미밥", "순두부찌개"],
      sides: ["탕수육", "김치", "단무지", "고등어구이", "시금치무침", "배추김치"]
    }
  },
  "2025-11-04": {
    bf: {
      mains: ["흑미밥", "북어국"],
      sides: ["계란후라이", "멸치볶음", "김자반", "배추김치"]
    },
    lc: {
      mains: ["백미밥", "시금치된장국", "오리훈제볶음밥"],
      sides: ["볶음우동", "햄미역줄기볶음", "무말랭이무침", "단무지", "배추김치"]
    },
    dn: {
      mains: ["백미밥", "어묵국"],
      sides: ["콩나물불고기", "양배추쌈", "햄미역줄기볶음", "무말랭이무침", "도시락김", "알마늘", "배추김치"]
    }
  },
  "2025-11-05": {
    bf: {
      mains: ["백미밥", "미역국"],
      sides: ["스팸구이", "계란말이", "콩나물무침", "배추김치"]
    },
    lc: {
      mains: ["백미밥", "콩나물국"],
      sides: ["제육볶음", "쏘야볶음", "무침시래기볶음", "미역초무침", "간장깻잎지", "배추김치"]
    },
    dn: {
      mains: ["백미밥", "떡만두국"],
      sides: ["동그랑땡", "무침시래기볶음", "미역초무침", "마늘쫑무침", "배추김치"]
    }
  },
  "2025-11-06": {
    bf: {
      mains: ["백미밥", "된장국"],
      sides: ["오징어볶음", "감자조림", "두부구이", "배추김치"]
    },
    lc: {
      mains: ["백미밥", "순대국"],
      sides: ["도토리묵무침", "오징어젓무침", "감자채볶음", "숙주무침", "얼갈이무침", "배추김치"]
    },
    dn: {
      mains: ["백미밥", "육개장"],
      sides: ["돈육김치볶음", "온두부", "감자채볶음", "숙주무침", "얼갈이무침", "배추김치", "배추김치"]
    }
  }
}

const setMenus = async (menus) => {
  for (const [date, mealData] of Object.entries(menus)) {
    const ref = doc(db, "weekly-menus", date);
    await setDoc(ref, {
      date,
      menus: mealData
    });
    console.log(`Menu for ${date} set successfully.`);
  }
};

// setMenus(menus);